app/controllers/posts_controller.rb

  def new
    @branch = params[:branch]
    @categories = Category.where(branch: @branch)
---
SELECT "categories".* FROM "categories" WHERE "categories"."branch" = $1  [["branch", "hobby"]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "K POP"], ["content", "Great music for anyone "], ["category_id", 1], ["user_id", 1], ["created_at", "2018-11-14 17:06:03.385875"], ["updated_at", "2018-11-14 17:06:03.385875"]]